#if 0
;
; Note: shader requires additional functionality:
;       Resource descriptor heap indexing
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: da6f762bb31c167282b4e548e70080bf.pdb
; shader hash: da6f762bb31c167282b4e548e70080bf
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(16,16,1)
;
;
; Buffer Definitions:
;
; cbuffer cb0
; {
;
;   struct cb0
;   {
;
;       uint4 DstRect;                                ; Offset:    0
;       float3 BrightPixelGain;                       ; Offset:   16
;       uint Width;                                   ; Offset:   28
;       uint Height;                                  ; Offset:   32
;       uint TransformType;                           ; Offset:   36
;       uint InputTextureOffset;                      ; Offset:   40
;       uint OutputTextureOffset;                     ; Offset:   44
;       uint DstPostFilterParaOffset;                 ; Offset:   48
;   
;   } cb0;                                            ; Offset:    0 Size:    52
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.4 (3e105849c)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !26)
!1 = !DIFile(filename: "./FFT_TwoForOne_Debug.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 19, type: !5, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!5 = !DISubroutineType(types: !6)
!6 = !{null, !7, !7, !17, !25}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 11, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 11, size: 64, align: 32, elements: !9, templateParams: !13)
!9 = !{!10, !12}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, line: 11, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, line: 11, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !{!14, !15}
!14 = !DITemplateTypeParameter(name: "element", type: !11)
!15 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 2)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 11, baseType: !18)
!18 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 11, size: 96, align: 32, elements: !19, templateParams: !23)
!19 = !{!20, !21, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !18, file: !1, line: 11, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !18, file: !1, line: 11, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !18, file: !1, line: 11, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!23 = !{!14, !24}
!24 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 3)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 6, baseType: !11)
!26 = !{!27, !38, !49, !51, !52, !53, !54, !55, !56}
!27 = !DIGlobalVariable(name: "DstRect", linkageName: "\01?DstRect@cb0@@3V?$vector@I$03@@B", scope: !0, file: !1, line: 4, type: !28, isLocal: false, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 4, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 4, size: 128, align: 32, elements: !31, templateParams: !36)
!31 = !{!32, !33, !34, !35}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 4, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 4, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 4, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !30, file: !1, line: 4, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!36 = !{!14, !37}
!37 = !DITemplateValueParameter(name: "element_count", type: !16, value: i32 4)
!38 = !DIGlobalVariable(name: "BrightPixelGain", linkageName: "\01?BrightPixelGain@cb0@@3V?$vector@M$02@@B", scope: !0, file: !1, line: 5, type: !39, isLocal: false, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 5, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 5, size: 96, align: 32, elements: !42, templateParams: !47)
!42 = !{!43, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 5, baseType: !44, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 5, baseType: !44, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 5, baseType: !44, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!47 = !{!48, !24}
!48 = !DITemplateTypeParameter(name: "element", type: !44)
!49 = !DIGlobalVariable(name: "Width", linkageName: "\01?Width@cb0@@3IB", scope: !0, file: !1, line: 6, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!51 = !DIGlobalVariable(name: "Height", linkageName: "\01?Height@cb0@@3IB", scope: !0, file: !1, line: 7, type: !50, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariable(name: "TransformType", linkageName: "\01?TransformType@cb0@@3IB", scope: !0, file: !1, line: 8, type: !50, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariable(name: "InputTextureOffset", linkageName: "\01?InputTextureOffset@cb0@@3IB", scope: !0, file: !1, line: 9, type: !50, isLocal: false, isDefinition: true)
!54 = !DIGlobalVariable(name: "OutputTextureOffset", linkageName: "\01?OutputTextureOffset@cb0@@3IB", scope: !0, file: !1, line: 10, type: !50, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariable(name: "DstPostFilterParaOffset", linkageName: "\01?DstPostFilterParaOffset@cb0@@3IB", scope: !0, file: !1, line: 11, type: !50, isLocal: false, isDefinition: true)
!56 = !DIGlobalVariable(name: "bModifyInput", scope: !4, file: !1, line: 28, type: !57, isLocal: true, isDefinition: true)
!57 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!58 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!59 = !{i32 2, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{!"dxcoob 1.8.2306.4 (3e105849c)"}
!62 = !{!".\5CFFT_TwoForOne_Debug.hlsl", !"\0D\0Acbuffer cb0 : register(b0)\0D\0A{\0D\0A    uint4 DstRect;\0D\0A    float3 BrightPixelGain;\0D\0A    uint Width;\0D\0A    uint Height;\0D\0A    uint TransformType;\0D\0A    uint InputTextureOffset;\0D\0A    uint OutputTextureOffset;\0D\0A    uint DstPostFilterParaOffset;\0D\0A};\0D\0A\0D\0A// \E9\9C\80\E8\A6\81\E7\94\A8preview\E7\89\88\E6\9C\AC\E7\9A\84dxc\0D\0A// \E4\B8\8D\E8\83\BD\E9\93\BE\E6\8E\A5dxil.dll \E8\BF\98\E6\98\AF\E8\AF\B4\E8\A6\81\E7\94\A8\E5\88\AB\E7\9A\84\E7\89\88\E6\9C\AC\E7\9A\84dxil\0D\0A// \E7\94\A8\E6\9C\80\E6\96\B0\E7\9A\84release dxil.dll \E4\BC\9A\E6\8A\A5\E9\94\99\E8\AF\AF\EF\BC\9F\0D\0A\0D\0A[numthreads(16, 16, 1)]\0D\0Avoid CSMain(\0D\0A    uint2 dispatchThreadId : SV_DispatchThreadID,\0D\0A    uint2 groupTheadId : SV_GroupThreadID,\0D\0A    uint3 groupId : SV_GroupID,\0D\0A    uint groupIndex : SV_GroupIndex\0D\0A    )\0D\0A{\0D\0A    const bool bIsHorizontal = (TransformType & 0x1);\0D\0A\09const bool bIsForward    = (TransformType & 0x2);\0D\0A\09const bool bModifyInput  = 1;\0D\0A\0D\0A\0D\0A    Texture2D<float4> SrcTexture = ResourceDescriptorHeap[InputTextureOffset];\0D\0A    RWTexture2D<float4> OutputTexture = ResourceDescriptorHeap[OutputTextureOffset];\0D\0A\0D\0A    OutputTexture[dispatchThreadId] = SrcTexture[dispatchThreadId];\0D\0A}"}
!63 = !{!"_WAVE_OP=1", !"_WAVE_OP=1"}
!64 = !{!".\5CFFT_TwoForOne_Debug.hlsl"}
!65 = !{!"-E", !"CSMain", !"-T", !"cs_6_8", !"/D", !"_WAVE_OP", !"/Zi", !"/enable-16bit-types", !"-D", !"_WAVE_OP", !"-Qembed_debug"}
!66 = !{i32 1, i32 8}
!67 = !{!"cs", i32 6, i32 8}
!68 = !{null, null, !69, null}
!69 = !{!70}
!70 = !{i32 0, %cb0* undef, !"cb0", i32 0, i32 0, i32 1, i32 52, null}
!71 = !{i32 0, %cb0 undef, !72}
!72 = !{i32 52, !73, !74, !75, !76, !77, !78, !79, !80}
!73 = !{i32 6, !"DstRect", i32 3, i32 0, i32 7, i32 5, i32 13, i32 4}
!74 = !{i32 6, !"BrightPixelGain", i32 3, i32 16, i32 7, i32 9, i32 13, i32 3}
!75 = !{i32 6, !"Width", i32 3, i32 28, i32 7, i32 5}
!76 = !{i32 6, !"Height", i32 3, i32 32, i32 7, i32 5}
!77 = !{i32 6, !"TransformType", i32 3, i32 36, i32 7, i32 5}
!78 = !{i32 6, !"InputTextureOffset", i32 3, i32 40, i32 7, i32 5, i32 9, i1 true}
!79 = !{i32 6, !"OutputTextureOffset", i32 3, i32 44, i32 7, i32 5, i32 9, i1 true}
